films/app/views/forums/index.html.haml

SELECT  "topics".* FROM "topics" WHERE (forum_id = 1)  ORDER BY "topics"."id" ASC LIMIT 1
SELECT COUNT(*) FROM "topics" WHERE "topics"."forum_id" = ?  [["forum_id", 1]]
---
          Topics:
          =forum.topics.count
          .p=forum.description