films/app/views/forums/show.html.haml

SELECT "topics".* FROM "topics" WHERE "topics"."forum_id" = ?  [["forum_id", 1]]
---
  %tbody
    - @forum.topics.each do |topic|

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
          Last post by
          =link_to User.find(topic.last_user_id).name, User.find(topic.last_user_id)