films/app/controllers/forums_controller.rb

SELECT "forums".* FROM "forums"
---
  def index
    @forums = Forum.all

INSERT INTO "forums" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "test"], ["description", "qwe"], ["created_at", "2016-04-15 12:04:21.843018"], ["updated_at", "2016-04-15 12:04:21.843018"]]
---
  def create
    @forum = Forum.new(forum_params)

    respond_to do |format|
      if @forum.save

UPDATE "forums" SET "description" = ?, "updated_at" = ? WHERE "forums"."id" = ?  [["description", "asd"], ["updated_at", "2016-04-15 18:37:14.832442"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @forum.update(forum_params)

SELECT  "forums".* FROM "forums" WHERE "forums"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_forum
      @forum = Forum.find(params[:id])