films/app/controllers/posts_controller.rb

  def create
    @post = @current_user.posts.build(post_params)
    @post.topic_id = $topicId
    @topic = Topic.find($topicId)
    @topic.last_user_id = @current_user.id
    @topic.updated_at = Time.now
    @topic.save
    respond_to do |format|
      if @post.save
---
SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", nil]]
UPDATE "topics" SET "last_user_id" = ?, "updated_at" = ? WHERE "topics"."id" = ?  [["last_user_id", 1], ["updated_at", "2016-04-15 20:59:21.422941"], ["id", 58]]
INSERT INTO "posts" ("user_id", "post_content", "topic_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["post_content", "Some post"], ["topic_id", 6], ["created_at", "2016-04-15 17:32:07.531723"], ["updated_at", "2016-04-15 17:32:07.531723"]]

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "post_content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["post_content", "Some posadsdsat"], ["updated_at", "2016-04-15 18:37:35.406170"], ["id", 6]]