films/app/controllers/topics_controller.rb

SELECT "topics".* FROM "topics"
---
  def index

    #render :text => @forum.inspect
    topics = Topic.all

INSERT INTO "topics" ("title", "content", "user_id", "forum_id", "last_user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "fucked up earlier"], ["content", ""], ["user_id", 2], ["forum_id", 2], ["last_user_id", 2], ["created_at", "2016-04-15 21:56:54.059037"], ["updated_at", "2016-04-15 21:56:54.059037"]]
---
  def create
    @topic = @current_user.topics.build(topic_params)
    #@topic.content = params[:content]
    #@topic = Topic.new(topic_params)
    #@topic.forum_id = @forum_id
    @topic.forum_id = $topicId
    @topic.last_user_id = @current_user.id
    respond_to do |format|
      if @topic.save

UPDATE "topics" SET "content" = ?, "updated_at" = ? WHERE "topics"."id" = ?  [["content", "asd"], ["updated_at", "2016-04-15 18:37:25.246830"], ["id", 6]]
---
  def update
    respond_to do |format|
      if @topic.update(topic_params)

DELETE FROM "topics" WHERE "topics"."id" = ?  [["id", 42]]
---
  def destroy
    @topic.destroy