films/app/views/topics/show.html.haml

  %tbody
    - @topic.posts.each do |post|
---
SELECT "posts".* FROM "posts" WHERE "posts"."topic_id" = ?  [["topic_id", 6]]